
$(document).ready(function() {
	//화면 로딩시 초기 설정
	onLoadSet();
});

function onLoadSet(){
	fn_createWholesalerDate(fruitData, "fruitList");
	fn_createWholesalerDate(VegetableData, "vegetableList");
}

let fruitData = [ 
              	 ["103@영주청과@임상근@@010-8200-7940@과일류"]
				,["105@일화청과@박종일@033-641-0039@010-6377-7838@과일류"]
				,["107@성남청과@김보유@033-645-4829@010-5395-4829@과일류"]
				,["113@샘플청과@박교근@033-642-9113@010-5113-9257@과일류"]
				,["114@대풍상회@김용인@033-645-4933@010-5365-2946@과일류"]
				,["116@한농청과@김계옥@033-646-7641@010-2571-8178@과일류"]
				,["120@한일청과@최종목@033-643-3776@010-2248-8198@과일류"]
				,["121@삼삼청과@유영훈@033-643-7729@010-5372-1213@과일류"]
				,["122@한미청과@이광섭@033-642-6510@010-2438-6007@수입과일"]
				,["127@강릉청과상회@문기환@033-643-4115@010-5376-0176@과일류"]
				,["128@자연청과@염기섭@033-643-8793@010-5372-8793@과일류"]
				,["132@아성청과@권혁엽@033-643-4008@010-5360-4008@과일류"]
				,["136@강원청과@정경남@033-642-6510@010-2438-6007@수입과일"]
				,["137@태양청과@정영희@033-643-3776@010-7477-5089@과일류"]
				,["138@잠수교청과@양준태@033-651-5085@@과일류"]
				,["139@보광상회@김만재@033-644-2590@010-9698-5534@과일류"]
				,["140@(주)대림청과@염용섭@033-643-8793@010-6772-8793@과일류"]
				,["141@다솜청과@임석민@033-645-4754@010-5031-4754@과일류"]
				,["142@(주)동아상회@김규석@033-644-2590@010-5675-7002@과일,견과류"]
				,["143@(주)소망청과@임필규@033-645-4754@010-5031-4754@과일류"]
		   ];
			   
let VegetableData=[
			 ["208@(주)주형농산@이명호@033-641-7060@010-4303-9132@청과류@식자재"]
			,["216@대성상회@강종화@033-646-4739@010-9058-4739@채소류"]
			,["220@(주)연한훼미리@박종일@033-643-8136@010-5376-8136@청과류@식자재"]
			,["221@청보상회@이재호@033-641-6045@010-5237-6045@마늘@양파"]
			,["230@군포농산@박기원@033-643-5999@010-8791-5999@양파@채소류"]
			,["246@거목농산@박윤수@033-645-2468@010-5363-0973@무@배추류"]
			,["251@(주)화신풍호@정길자@033-648-2737@010-9577-9161@청과류@식자재"]
			,["255@공신상회@이옥향@033-645-0807@010-3363-0807@채소류@조미료"]
			,["265@경남마늘@강민석@033-642-3140@010-5400-3140@마늘"]
			,["270@그린농산@주옥분@033-643-4485@010-3385-4485@양파"]
			,["271@대가농산@김재범@-@010-5374-1101@채소류@"]
			,["275@하솔푸드@최옥순@033-647-3425@010-3360-2993@채소류"]
			,["277@무공해농산@장석훈@033-641-2472@010-5036-0713@양파"]
			,["280@하나@정창록@033-535-7330@010-2068-9290@-"]
			,["281@더푸드사천@최정애@-@010-5366-3222@채소류@"]
			,["282@이화농산@장재화@033-643-3425@010-9107-3594@채소류"]
			,["284@대관령푸드S@장영애@033-335-1333@010-9819-1333@채소류"]
			,["285@강릉상회@남복신@033-645-1349@010-5375-1349@채소류"]
];
			   
function fn_createWholesalerDate(data, divClssNm){

	let wholsalerList = "";
		wholsalerList+="<ul class='tt_head'>";
		wholsalerList+="<li class='col_trader_num'>중도매인번호</li>";
		wholsalerList+="<li class='col_company_name'>상호</li>";
		wholsalerList+="<li class='col_name'>이름</li>";
		wholsalerList+="<li class='col_place_phone'>점포전화번호</li>";
		wholsalerList+="<li class='col_mobile_phone'>휴대폰</li>";
		wholsalerList+="<li class='col_item'>취급품목</li>";
		wholsalerList+="</ul>";
		
	for(let i=0; i<data.length;i++){
		let rowData = data[i][0].split('@');
		wholsalerList+="<ul class='tt_body'>";
		wholsalerList+="<li class='col_trader_num'><p class='num'>"+rowData[0]+"</p></li>";
		wholsalerList+="<li class='col_company_name'>"+rowData[1]+"</p></li>";
		wholsalerList+="<li class='col_name'>"+rowData[2]+"</p></li>";
		if(rowData[3]==''){
			wholsalerList+="<li class='col_place_phone'>-</p></li>";
		}else{
			wholsalerList+="<li class='col_place_phone'>"+rowData[3]+"</p></li>";
		}
		if(rowData[4]==''){
			wholsalerList+="<li class='col_place_phone'>-</p></li>";
		}else{
			wholsalerList+="<li class='col_mobile_phone'>"+rowData[4]+"</p></li>";
		}
		if(rowData[5]==''){
			wholsalerList+="<li class='col_place_phone'>-</p></li>";
		}else{
			wholsalerList+="<li class='col_item'>"+rowData[5]+"</p></li>";
		}
		wholsalerList+="</ul>";
	}
	
	
	$("#"+divClssNm).append(wholsalerList);
};
